# NonSupportedCurtainWall Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainWallFailures..::..NonSupportedCurtainWall Property
BuiltInFailures..::..CurtainWallFailures Class See Also
---
Currently, only straight Walls with straight or arc edges are supported for non-rectangular Curtain Walls.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NonSupportedCurtainWall { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NonSupportedCurtainWall As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NonSupportedCurtainWall {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainWallFailures Class
Autodesk.Revit.DB Namespace